# GetDoubleValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..GetDoubleValue Method
ColorFillSchemeEntry Class See Also
---
Gets the Double value stored within the entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public double GetDoubleValue()
```

Visual Basic
---
```text
Public Function GetDoubleValue As Double
```

Visual C++
---
```text
public:
double GetDoubleValue()
```

# ### Return Value
The Double value contained in the entry.
# Remarks
This method should only be used if the StorageType property reports the type of the entry as a Double.
# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace